# Fonts
tap "homebrew/cask-fonts"
cask "font-blex-mono-nerd-font" # IBM Plex Mono

# Terminal
brew "fish"
brew "fisher"
brew "starship"
cask "alacritty", args: { no_quarantine: true }
cask "ghostty"

# Git
brew "git"
brew "git-delta"

# Editor
brew "nvim"

# Necessary tooling
brew "go"
brew "jq"
brew "python-yq"
brew "ripgrep"
brew "tmux"
brew "fzf"
brew "zoxide"
brew "eza"
brew "sqlite"
brew "node"

# Better cat
brew "bat"

# Diagrams
# brew "plantuml"

# Monitoring
brew "bottom"

# Fun
brew "gum"

# Cli markdown reader
brew "glow"

# Better sed
brew "sd"

# Shorter man pages with examples
brew "tldr"

# xrandr for macos
brew "displayplacer"

# Benchmarking tool
brew "hyperfine"

# Github CLI
brew "gh"

# LLM
brew "ollama"

# Apps
## Containers
cask "docker"
## Communication
cask "slack"
## Notes and knowledge base
cask "obsidian"
## UI design
cask "figma"
## Image manipulation
cask "gimp"
## Keybinding
cask "karabiner-elements"
## Browser
cask "firefox"
# Window tiling manager
cask "nikitabobko/tap/aerospace"

# Top bar
tap "FelixKratz/formulae"
brew "FelixKratz/formulae/sketchybar"
# Window borders
brew "FelixKratz/formulae/borders"
