# Fonts
tap "homebrew/cask-fonts"
cask "font-blex-mono-nerd-font" # IBM Plex Mono

# Terminal
brew "fish"
brew "starship"
cask "alacritty"

# Git diff
brew "git-delta"

# Editor
brew "nvim"

# Necessary tooling
brew "jq"
brew "yq"
brew "ripgrep"
brew "tmux"
brew "fzf"
brew "zoxide"
brew "eza"
brew "sqlite"

# Virtualization
brew "docker"

# GUI tools
brew "yabai"
brew "skhd"

# Better cat
brew "bat"

# Diagrams
# brew "plantuml"

# Monitoring
brew "bottom"

# Fun
brew "gum"

# Cli markdown reader
brew "glow"

# Better sed
brew "sd"

# Shorter man pages with examples
brew "tldr"

# Benchmarking tool
brew "hyperfine"

# Github CLI
brew "gh"

# Apps
## Containers
cask "docker"
## Communication
cask "slack"
## Notes and knowledge base
cask "obsidian"
## UI design
cask "figma"
## Image manipulation
cask "gimp"
## Keybinding
cask "karabiner-elements"
