# Terminal
brew "fish"
brew "starship"
cask "alacritty"
cask "lynx"

# Git diff
brew "git-delta"

# Editor
brew "nvim"

# Necessary tooling
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "tmux"
brew "zoxide"

# Virtualization
brew "podman"
brew "docker"

# GUI tools
brew "yabai"
brew "skhd"

# Languages
brew "python3"
brew "luajit"

# Better cat
brew "bat"

# Diagrams
brew "plantuml"

# Fun
brew "gum"

# Cli markdown reader
brew "glow"

# Better sed
brew "sd"

# Shorter man pages with examples
brew "tldr"

# Benchmarking tool
brew "hyperfine"

# System information
brew "gtop"
brew "gping"

# Github CLI
brew "gh"

# Apps
# Communication
cask "slack"
# Notes and knowledge base
cask "obsidian"
# UI design
cask "figma"
# Keybinding
cask "karabiner-elements"
